; domain
(define (domain briefcase)
(:predicates (at ?y ?x)
             (in ?x)
             (is-at ?x))



(:action move
  :parameters (?m ?l)
  :precondition  (is-at ?m)
  :effect (and (is-at ?l) (not (is-at ?m))
		    (forall (?x) (when (in ?x)
		      (and (at ?x ?l) (not (at ?x ?m)))))))

  (:action take-out
      :parameters (?x)
      :precondition (in ?x)
      :effect (not (in ?x)))
      
  (:action put-in
      :parameters (?x ?l)
      :precondition (and (not (in ?x)) (at ?x ?l) (is-at ?l))
      :effect (in ?x)))

; problem
(define (problem brief)
  (:domain briefcase)
  (:objects
     p1
     p2
     l2
     l1

     )
  (:init
   (at p1 l2 )
   (at p2 l1 )
     (is-at l1)

   )
  (:goal
   (and
   (at p1 l1 )
   (at p2 l2 )
)
   ))

; plan
1. (put-in p2 l1)
   added: (in p2)
   goals met: 0 of 2
2. (move l1 l2)
   deleted: (is-at l1) (at p2 l1)
   added: (is-at l2) (at p2 l2)
   goals met: 1 of 2
3. (put-in p1 l2)
   added: (in p1)
   goals met: 1 of 2
4. (take-out p2)
   deleted: (in p2)
   goals met: 1 of 2
5. (move l2 l1)
   deleted: (is-at l2) (at p1 l2)
   added: (is-at l1) (at p1 l1)
   goals met: 2 of 2
